{"podcast_details": {"podcast_title": "Meditation Minis Podcast", "episode_title": "Walk On The Pier For Letting Go", "episode_image": "https://audioboom.com/i/40799984.png", "episode_transcript": " Welcome to the Meditation Minis podcast. Mind-shifting meditations to help you feel better fast with your host, hypnotist, Shel Hamilton. Hello and welcome. Thank you so much for not only taking a little time out of your day for yourself, but choosing to spend that time with me and a meditation mini. This is a fabulous meditation for getting rid of anxiety in a gentle but powerful way. You can also use it if what you're experiencing isn't anxiety, but it's more like irritation, anger, frustration, self-doubt. Just during the meditation, imagine that feeling instead of anxiety when I say the word anxiety in it. So when I say anxiety, you would instead imagine self-doubt or tension or whatever it is that you are wanting to release from your body, mind, and life at this moment. This episode is brought to you by Indeed. Is hiring challenging? Yes. Do you love a challenge? Also, yes. And you need a hiring partner who can help you rise to the challenge you need Indeed. The thing I love most about Indeed is that they make it easy because everything is in one place. Indeed does the hard work for you because it shows you candidates whose resumes fit your description immediately after you post so that you can hire faster. Even better, Indeed is the only job site where you pay just for applications that meet your must-have requirements. So it's not surprising that Indeed is delivering four times more hires than all other job sites combined according to Talent Nest 2019. Start hiring now with a $75 sponsored job credit to upgrade your job post at Indeed.com slash minis. Offer good for a limited time. Claim your $75 credit now at Indeed.com slash minis. Just go to Indeed.com slash minis and support the show by saying you heard about it on this podcast. Indeed.com slash minis. Terms and conditions apply. Need to hire you need Indeed. Make yourself comfortable. And if you choose, you can close your eyes. Begin by taking one slow breath in through your nose and exhaling through your mouth. Following that with two more breaths in through the nose, exhaling through your mouth. I don't know if you've ever had the experience of being on one of those large piers that go over the ocean side. But even if you haven't, you've probably seen one in a movie someplace. Imagine now that you're walking from the shore on to the pier and it's solid. Feels very safe. Maybe there's other people there, fishermen, people walking, holding hands, kids laughing. Or maybe you are all alone on this pier. And as you walk out, there's railings on both sides, safe, secure. And find a spot now either to lean on the railing or to sit on a bench. And as you do, just take another deep breath and let it go. Next, what I'd like you to do is I'd like you to imagine all of that anxiety inside of you. Imagine it coming out of you and filling a bucket that's there at your feet. Imagine the anxiety, maybe it's a color, maybe it's a texture, a glow. Maybe it's like sludge. And with every exhale, allowing that anxiety in your body, in your mind, in your gut, in your hands, in your head to exit your body and fill up that bucket. And when your first bucket is full of all of that anxiety, then go ahead and turn and dump it over the side of the pier into the ocean. The salty water of the ocean neutralizes it completely. Go ahead now and continue to imagine the anxiety in your body. Maybe again, it's a color or a texture. And with every exhale, you're releasing it into the bucket in whatever way makes sense for you. Maybe it's coming out of your hand. Maybe it's just flowing out of your body. Maybe it exits as tears. As you fill that bucket up with your anxiety. And once it's full again, go ahead and dump it into the ocean below you. And the salty water neutralizes it completely and washes it away. Now we're going to do this a couple more times so that you can really ensure that you have gotten all of that excess anxiety out of your body, out of your gut, out of your feet, your hands, your head. But before we go any further, if you feel like there's a part of you that needs to hold on to just a little handful of that anxiety so that you can feel safe, then go ahead now, just scoop it out into your hand and stick it in your pocket. And taking that bucket once again. And in whatever way makes sense for you, imagine, get a sense of picture, feel how it would feel to allow the anxiety that still remains in the cells and bones of your being to exit your body and fill that bucket. And then dumping it into the ocean, the ocean neutralizing it. And continue to do that as quickly or as slowly as you feel called to over the next minute. And finishing up now if you haven't done so already. And before we finish this meditation today, the next thing I'd like you to do is imagine yourself breathing in that salty, fresh air. With every breath that salty, fresh air enters the cells of your being. Feel yourself beginning to shimmer and glow, filling up on this beautiful glimmering light. Filling every cell of your being completely. If you've kept a little anxiety there in your pocket, that's fine. Just tap it and smile to yourself as all of the rest of you is full of this beautiful lightness and energy ready to take on your day. Preparing yourself now to open your eyes. Thank you so much for spending this part of your day with me today. I'm Shal Hamilton. You are listening to the Meditation Minis podcast. Create an amazing day."}, "podcast_summary": "In this episode of the Meditation Minis podcast, Shel Hamilton introduces a meditation that helps get rid of anxiety. The meditation can be modified to address other negative emotions such as irritation, anger, frustration, or self-doubt. Hamilton suggests imagining being on a solid pier by the ocean, where one can feel safe and secure. The listener is guided to imagine their anxiety as a color, texture, or glow, and with each exhale, release it into a bucket placed at their feet. Once the bucket is full, they are encouraged to dump it into the ocean, where the salty water neutralizes it completely. This process can be repeated multiple times for a complete release of anxiety. If the listener feels the need to hold onto a small amount of anxiety, they can keep it in their pocket. Towards the end of the meditation, Hamilton prompts the listener to imagine breathing in the salty, fresh air, filling them with a shimmering light, and preparing them to face the day with energy and positivity. The episode is sponsored by Indeed, and Hamilton encourages listeners to visit indeed.com/minis for a $75 sponsored job credit. The episode concludes with Hamilton thanking the listener for their time and encouraging them to have an amazing day.", "podcast_guest": "Wikipedia page was not found for Shel Hamilton", "podcast_highlights": "Main topics discussed in this episode of the Meditation Minis podcast include:\n1. Using meditation to get rid of anxiety, irritation, anger, frustration, and self-doubt.\n2. Imagining a pier by the ocean and using it as a visualization tool for releasing anxiety.\n3. Filling a bucket with anxiety and dumping it into the ocean to neutralize it.\n4. Breathing in salty, fresh air to fill the body with a beautiful glimmering light.\nHighlights:\n- The meditation is gentle but powerful in helping to release negative emotions.\n- The visualization of the pier provides a safe and secure environment for the meditation.\n- The use of the ocean water to neutralize anxiety adds a sense of cleansing and relief.\n- Breathing in the salty air fills the body with positive energy and light.\n- The meditation can be modified to focus on different emotions or feelings besides anxiety.\n- The episode is sponsored by Indeed, a hiring partner for businesses."}